; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v10 ?v2)
             (pred_2 ?v8 ?v5)
             (pred_11 ?v10 ?v5)
             (pred_5 ?v4 ?v10 )
	     (pred_7 ?v10)
             (pred_8 ?v1)
             (pred_3 ?v8)
             (pred_4 ?v5)
             (pred_10 ?v10)
             (pred_9 ?v8)
             (pred_12 ?v10)
             (pred_1 ))



(:action op_2
:parameters (?v6 ?v11 ?v7 ?v9)
:precondition (and (pred_8 ?v6) (pred_8 ?v11) (pred_3 ?v7) (pred_4 ?v9)
          (pred_6 ?v6 ?v11) (pred_2 ?v7 ?v9)
                   (pred_11 ?v11 ?v9) (pred_7 ?v6) 
                   (pred_10 ?v11) (pred_9 ?v7))
:effect (and  (pred_12 ?v11) (not (pred_10 ?v11))))


(:action op_5
:parameters (?v6 ?v13)
:precondition (and (pred_8 ?v6) (pred_8 ?v13)
               (pred_7 ?v6) (pred_6 ?v6 ?v13) (pred_12 ?v13))
:effect (and (pred_7 ?v13) (not (pred_7 ?v6))))

(:action op_1
:parameters (?v6 ?v7)
:precondition (and (pred_8 ?v6) (pred_3 ?v7) 
                  (pred_7 ?v6) (pred_5 ?v7 ?v6) (pred_1 ))
:effect (and (pred_9 ?v7)
   (not (pred_5 ?v7 ?v6)) (not (pred_1 ))))


(:action op_3
:parameters (?v6 ?v3 ?v12)
:precondition (and (pred_8 ?v6) (pred_3 ?v3) (pred_3 ?v12)
                  (pred_7 ?v6) (pred_9 ?v12) (pred_5 ?v3 ?v6))
:effect (and (pred_9 ?v3) (pred_5 ?v12 ?v6)
        (not (pred_9 ?v12)) (not (pred_5 ?v3 ?v6))))

(:action op_4
:parameters (?v6 ?v7)
:precondition (and (pred_8 ?v6) (pred_3 ?v7) 
                  (pred_7 ?v6) (pred_9 ?v7))
:effect (and (pred_1 ) (pred_5 ?v7 ?v6) (not (pred_9 ?v7)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_21 obj_27 obj_01 obj_26 obj_11 obj_18 obj_17 obj_24 obj_10 obj_25 obj_30 obj_09 obj_08 obj_15 obj_20 obj_29 obj_14 obj_23 obj_28 obj_07 obj_22 obj_19 obj_04 obj_16 obj_02
    obj_12 obj_13
    obj_06 obj_03 obj_05
    )

    (:init
       (pred_1)

       (pred_8 obj_21)
       (pred_8 obj_27)
       (pred_8 obj_01)
       (pred_8 obj_26)
       (pred_8 obj_11)
       (pred_8 obj_18)
       (pred_8 obj_17)
       (pred_8 obj_24)
       (pred_8 obj_10)
       (pred_8 obj_25)
       (pred_8 obj_30)
       (pred_8 obj_09)
       (pred_8 obj_08)
       (pred_8 obj_15)
       (pred_8 obj_20)
       (pred_8 obj_29)
       (pred_8 obj_14)
       (pred_8 obj_23)
       (pred_8 obj_28)
       (pred_8 obj_07)
       (pred_8 obj_22)
       (pred_8 obj_19)
       (pred_8 obj_04)
       (pred_8 obj_16)
       (pred_8 obj_02)
       (pred_4 obj_12)
       (pred_4 obj_13)
       (pred_3 obj_06)
       (pred_3 obj_03)
       (pred_3 obj_05)

       (pred_6 obj_21 obj_18)
       (pred_6 obj_21 obj_27)
       (pred_6 obj_27 obj_17)
       (pred_6 obj_27 obj_01)
       (pred_6 obj_27 obj_21)
       (pred_6 obj_01 obj_24)
       (pred_6 obj_01 obj_26)
       (pred_6 obj_01 obj_27)
       (pred_6 obj_26 obj_10)
       (pred_6 obj_26 obj_11)
       (pred_6 obj_26 obj_01)
       (pred_6 obj_11 obj_25)
       (pred_6 obj_11 obj_26)
       (pred_6 obj_18 obj_30)
       (pred_6 obj_18 obj_17)
       (pred_6 obj_18 obj_21)
       (pred_6 obj_17 obj_09)
       (pred_6 obj_17 obj_24)
       (pred_6 obj_17 obj_27)
       (pred_6 obj_17 obj_18)
       (pred_6 obj_24 obj_08)
       (pred_6 obj_24 obj_10)
       (pred_6 obj_24 obj_01)
       (pred_6 obj_24 obj_17)
       (pred_6 obj_10 obj_15)
       (pred_6 obj_10 obj_25)
       (pred_6 obj_10 obj_26)
       (pred_6 obj_10 obj_24)
       (pred_6 obj_25 obj_20)
       (pred_6 obj_25 obj_11)
       (pred_6 obj_25 obj_10)
       (pred_6 obj_30 obj_29)
       (pred_6 obj_30 obj_09)
       (pred_6 obj_30 obj_18)
       (pred_6 obj_09 obj_14)
       (pred_6 obj_09 obj_08)
       (pred_6 obj_09 obj_17)
       (pred_6 obj_09 obj_30)
       (pred_6 obj_08 obj_23)
       (pred_6 obj_08 obj_15)
       (pred_6 obj_08 obj_24)
       (pred_6 obj_08 obj_09)
       (pred_6 obj_15 obj_28)
       (pred_6 obj_15 obj_20)
       (pred_6 obj_15 obj_10)
       (pred_6 obj_15 obj_08)
       (pred_6 obj_20 obj_07)
       (pred_6 obj_20 obj_25)
       (pred_6 obj_20 obj_15)
       (pred_6 obj_29 obj_22)
       (pred_6 obj_29 obj_14)
       (pred_6 obj_29 obj_30)
       (pred_6 obj_14 obj_19)
       (pred_6 obj_14 obj_23)
       (pred_6 obj_14 obj_09)
       (pred_6 obj_14 obj_29)
       (pred_6 obj_23 obj_04)
       (pred_6 obj_23 obj_28)
       (pred_6 obj_23 obj_08)
       (pred_6 obj_23 obj_14)
       (pred_6 obj_28 obj_16)
       (pred_6 obj_28 obj_07)
       (pred_6 obj_28 obj_15)
       (pred_6 obj_28 obj_23)
       (pred_6 obj_07 obj_02)
       (pred_6 obj_07 obj_20)
       (pred_6 obj_07 obj_28)
       (pred_6 obj_22 obj_19)
       (pred_6 obj_22 obj_29)
       (pred_6 obj_19 obj_04)
       (pred_6 obj_19 obj_14)
       (pred_6 obj_19 obj_22)
       (pred_6 obj_04 obj_16)
       (pred_6 obj_04 obj_23)
       (pred_6 obj_04 obj_19)
       (pred_6 obj_16 obj_02)
       (pred_6 obj_16 obj_28)
       (pred_6 obj_16 obj_04)
       (pred_6 obj_02 obj_07)
       (pred_6 obj_02 obj_16)
       (pred_10 obj_30)
       (pred_10 obj_28)
       (pred_10 obj_21)
       (pred_11  obj_30 obj_12)
       (pred_11  obj_28 obj_13)
       (pred_11  obj_21 obj_12)
       (pred_12 obj_27)
       (pred_12 obj_01)
       (pred_12 obj_26)
       (pred_12 obj_11)
       (pred_12 obj_18)
       (pred_12 obj_17)
       (pred_12 obj_24)
       (pred_12 obj_10)
       (pred_12 obj_25)
       (pred_12 obj_09)
       (pred_12 obj_08)
       (pred_12 obj_15)
       (pred_12 obj_20)
       (pred_12 obj_29)
       (pred_12 obj_14)
       (pred_12 obj_23)
       (pred_12 obj_07)
       (pred_12 obj_22)
       (pred_12 obj_19)
       (pred_12 obj_04)
       (pred_12 obj_16)
       (pred_12 obj_02)

       (pred_2  obj_06 obj_12)
       (pred_2  obj_03 obj_13)
       (pred_2  obj_05 obj_12)
       (pred_5 obj_06 obj_22)
       (pred_5 obj_03 obj_01)
       (pred_5 obj_05 obj_04)
       (pred_7 obj_27)
    )

    (:goal (and
       (pred_5 obj_03 obj_09)
    ))
(:constraints
  (always (not (pred_7 obj_17)))
)
)

; plan
1. (op_5 obj_27 obj_01)
   deleted: (pred_7 obj_27)
   added: (pred_7 obj_01)
   goals met: 0 of 1
2. (op_1 obj_01 obj_03)
   deleted: (pred_5 obj_03 obj_01) (pred_1)
   added: (pred_9 obj_03)
   goals met: 0 of 1
3. (op_5 obj_01 obj_24)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_24)
   goals met: 0 of 1
4. (op_5 obj_24 obj_08)
   deleted: (pred_7 obj_24)
   added: (pred_7 obj_08)
   goals met: 0 of 1
5. (op_5 obj_08 obj_09)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_09)
   goals met: 0 of 1
6. (op_4 obj_09 obj_03)
   deleted: (pred_9 obj_03)
   added: (pred_1) (pred_5 obj_03 obj_09)
   goals met: 1 of 1
